{
  "NAVBAR": {
    "SEARCH": "Поиск",
    "DASHBOARD": "Панель управления",
    "SIGNUP": "Регистрация",
    "SIGNIN": "Вход",
    "SIGNOUT": "Выход",
    "EDUCATION": "Образование",
    "STRUCTURE": "Структура",
    "CLUSTER": "<span class='h6 mb-0'>Кластер</span><div class='text-small text-muted'>Инжиниринг, моделирование</div><div class='text-small text-muted'>Front-end реализация</div><div class='text-small text-muted'>Back-end реализация</div>",    
    "CHAIR": "<span class='h6 mb-0'>Кафедра</span><p class='text-small text-muted'>Подробнее о кафедре</p>",
    "SCIENCE": "Наука",
    "MANUFACTURING": "ERP Системы",
    "TOOLS": "Микросервисы",
    "PARTICIPANTS": "Участники",
    "PROJECTS": "Проекты",
    "CONTACTS": "Контакты"
  },
  "HOME": {
    "INTRO": "Машиностроительный Java<br> кластер открытых информационных технологий",
    "SECONDARY": "Единая платформа на стыке машиностроения и Java, Web 3.0 технологий",
    "JAVAMACH": "<h5 class='mt-0 mb-3 text-center text-md-left'>JM cluster</h5><p>Java International Machine-building Cluster of open Information Technology - это кластер, объединяющий на добровольной основе организации и людей на едином принципе: использования языка программирования Java и Web технологий для решения задач машиностроения и промышленности.</p><p class='mb-0'>Наша цель - создание единой практической, научной, учебной платформы на основных принципах Индустрии 4.0 </p>",
    "INDUSTRY4": "<h5 class='mt-0 mb-3 text-center text-md-left'>Индустрия 4.0</h5><p>Трансформация в полностью цифровое производство, управляемое интеллектуальными системами, которые взаимодействуют с окружающей средой, выходя за рамки предприятия с целью формирования глобальной промышленной сети.</p><p class='mb-0'>Включает в себя Большие данные (Big data), на основе которых формируются решения; Internet of Things (IoT) - взаимодействие модулей на основе сетевых протоколов и сенсоров; ERP системы нового поколения.</p>",
    "ERP": "<h5 class='mt-0 mb-3 text-center text-md-left'>ERP Системы</h5><p>Реализуют принцип обозримости. Позволяют видеть картину предприятия в реальном времени и принимать необходимые решения. Состоят из автономных сервисов, каждый из которых имеет свое назначение. Хранение данных происходит в облаке, к которому подключается ERP система.</p>",
    "COPYRIGHT": "© 2020 JM cluster. Все права защищены."
  },
  "CLUSTER": {
    "TITLE": "JM cluster структура",
    "DESCRIPTION": "<h5>JM cluster решает ряд задач:</h5><ul><li>Создание общей платформы информационного обмена</li><li>Внедрение современных инженерных стандартов</li><li>Разработка ERP систем и компонентов на Open Source технологиях</li><li>Современная образовательная подготовка и многое другое</li></ul>"

  },
  "ERP": {
    "DESCRIPTION": {
      "INTRO": "<p>Каждое предприятие ставит перед собой определённые цели. Эти цели и определяют успешность предприятия в современных реалиях. Повышение качества продукции, оптимизация и снижение затрат, увеличение своей доли на рынке, обеспечение необходимого уровня рентабельности - на пути к этому компании сталкиваться с различными проблемами:</p> <ul> <li>Cложность согласования действия различных структурных подразделений</li> <li>Отсутствие единого информационного пространства для работы каждого сотрудника</li> <li>Неполный анализ эффективности систем</li> <li>Производственные проблемы</li> <li>Проблемы маркетинга, рекламы и сбыта</li> <li>Недостаток знаний и опыта у персонала</li> <li>Отраслевые специфики деятельности различных предприятий</li> </ul> <p>Решение данных проблем для современных предприятий мы видим в:</p> <ul> <li>Aвтоматизации основных процессов, протекающих на предприятии</li> <li>Использование многомодульных ERP систем, построенных на базе Open Source (открытое программное обеспечение) технологий</li> <li>Применение микросервисов в таких системах</li> </ul>",
      "STRUCTURE": {
        "TITLE": "Структура ERP",
        "DESCRIPTION": "<p><b>Платформа.</b> Программная среда, в которой будет производиться работа. В ней задаются правила поведения, базовый функционал и взаимодействия модулей, компонентов этой системы.</p> <p><b>Данные.</b> В эту категорию входят хранилище данных на сервере, программное обеспечение для работы с базами данных (SQL или любая альтернатива), инструменты для интерпретации и обработки данных и отправки их в программные модули.</p> <p><b>Модули.</b> Компоненты, которые подключаются к платформе по мере необходимости. Все они работают с базой данных и применяют базовый функционал. В целом модули должны работать независимо друг от друга, и должны «бесшовно» подключаться и отключаться, если потребность в них исчезла. Даная парадигма отлично вписывается в концепцию микросервисов. И является - важной отличительной чертой ERP-системы.</p>"
      },
      "MICROSERVICE": {
        "TITLE": "Микросервисная архитектура",
        "DESCRIPTION": "<p>Описанная выше структура характерна для ERP систем с логической точки зрения. Но на практике трудно реализовать  многомодульность. И часто ERPсистемы выделяют все модули действительно в отдельные продукты. Что противоречит концепции.</p> <p>Поэтому мы предлагаем строить эти модули на базе микросервисной архитектуры. Что же такое микросервисы?</p> <p>Это современное представление сервисориентированной архитектуры (SOA), используемое для создания распределенных программных систем. Подмодули в архитектуре микросервисов взаимодействуют друг с другом для выполнения определенной цели. <b>Микросервисы</b> - это архитектурный стиль, в котором крупные сложные программные приложения состоят из одного или нескольких меньших микросервисов. Каждый из этих микросервисов сосредоточен на выполнении одной задачи, которая представляет собой маленькую функциональность бизнеса.</p> <p>Архитектурный подход к проектированию микросервисов отлично вписывается в идею модульности ERP систем и может привнести следующие преимущества в ней.</p> <p><b>Гибкость и эффективность работы: </b>разработчики могут создавать, разворачивать и тестировать микросервис независимо от других компонентов, используя намного более короткие итерационные циклы. Микросервис — всего лишь один из множества компонентов, поэтому для его разработки можно использовать наиболее подходящий для требуемой функциональности язык программирования или среду, а также оптимальный механизм устойчивости.</p> <p><b>Масштабируемость:</b> команда разработчиков микросервиса может масштабировать компоненты во время выполнения независимо от других микросервисов, тем самым обеспечивая эффективное использование ресурсов и оперативное реагирование на изменения нагрузки.</p> <p><b>Устойчивость:</b> различные технологии, позволяют быстро отключать микросервисы в случае сбоев, без ущерба для других несвязанных функций. В то же время в реализациях микросервисов не применяется модель сохранения текущего состояния, что позволяет мгновенно перераспределить нагрузку и практически незамедлительно инициализировать новые среды выполнения.</p> <p>В ERP системе очень четко разделены границы модулей. И отключение любого из них (кроме некоторых базовых возможностей) никак не повлияет на работу оставшихся. Если компания нацелена на максимальное соответствие постоянно меняющимся условиям рынка и потребностям клиентов, ей просто необходимо оперативный обмен данными между подразделениями и оперативность принятия управленческих решений.</p>"
      }
    }
  },
  "PROJECTS": {
    "TITLE": "Проекты"
  },
  "SCIENCE": {
    "TITLE": "Научная деятельность",
    "DESCRIPTION": "<h5>Основные направления научной деятельности:</h5> <ul> <li>Моделирование быстропротекающих физических процессов</li> <li>Технологии автоматизированного управления технологическими процессами</li> <li>Технологическое обеспечение High Speed Machining</li> <li>Интеллектуальные системы инженерного расчета</li> <li>Разработка и внедрение ERP систем и компонентов на Open Source технологиях и многое другое</li> </ul> <h5>Публикации:</h5>"
  },
  "PARTICIPANTS": {
    "TITLE": "Участники кластера"
  }
}