{
  "NAVBAR": {
    "SEARCH": "Пошук",
    "DASHBOARD": "Панель керування",
    "SIGNUP": "Реєстрація",
    "SIGNIN": "Вхід",
    "SIGNOUT": "Вихід",
    "EDUCATION": "Освіта",
    "STRUCTURE": "Структура",
    "CLUSTER": "<span class='h6 mb-0'>Кластер</span><div class='text-small text-muted'>Інжиніринг, моделювання</div><div class='text-small text-muted'>Front-end реалізація</div><div class='text-small text-muted'>Back-end реалізація</div>",    
    "CHAIR": "<span class='h6 mb-0'>Кафедра</span><p class='text-small text-muted'>Детальніше про кафедру</p>",
    "KHPI": "<span class='h6 mb-0'>НТУ \"ХПІ\"</span><p class='text-small text-muted'>Детальніше про інститут</p>",
    "SCIENCE": "Наука",
    "MANUFACTURING": "ERP Системи",
    "TOOLS": "Мікросервіси",
    "PARTICIPANTS": "Учасники",
    "PROJECTS": "Проєкти",
    "CONTACTS": "Контакти"
  },
  "HOME": {
    "INTRO": "Машинобудівний Java<br> кластер відкритих інформаційних технологій",
    "SECONDARY": "Єдина платформа на стику машинобудування і Java, Web технологій",
    "JAVAMACH": "<h5 class='mt-0 mb-3 text-center text-md-left'>JM cluster</h5><p>Java International Machine-building Cluster of open Information Technology - це кластер, об'єднуючий на добровільній основі організації та людей на єдиному принципі: використання мови програмування Java та Web технологій для вирішення задач машинобудування та промисловості.</p><p class='mb-0'>Наша ціль - створення єдиної практичної, наукової, навчальної платформи на основних принципах Індустрії 4.0</p>",
    "INDUSTRY4": "<h5 class='mt-0 mb-3 text-center text-md-left'>Індустрія 4.0</h5><p>Трансформація в повністю цифрове виробництво, кероване інтелектуальними системами, які взаємодіють з навколишнім середовищем, виходячи за рамки підприємства з метою формування глобальної промислової мережі.</p><p class='mb-0'>Включає в себе Великі дані (Big data), на основі яких формуються рішення; Internet of Things (IoT) - взаємодія модулів на основі мережевих протоколів і сенсорів; ERP системи нового покоління.</p>",
    "ERP": "<h5 class='mt-0 mb-3 text-center text-md-left'>ERP Системи</h5><p>Реалізують принцип наочності. Дозволяють бачити картину підприємства в реальному часі і приймати необхідні рішення. Складаються з автономних сервісів, кожен з яких має своє призначення. Зберігання даних відбувається в хмарі, до якої підключається ERP система.</p>",
    "COPYRIGHT": "© 2020 JM cluster. Всі права захищені."
  },
  "CLUSTER": {
    "TITLE": "JM cluster структура",
    "DESCRIPTION": "<h5>JM cluster вирішує ряд завдань: </h5><ul><li>Створення спільної платформи інформаційного обміну</li><li>Впровадження сучасних інженерних стандартів</li><li>Розробка ERP систем і компонентів на Open Source технологіях</li><li>Сучасна освітня підготовка та інше</li></ul>"
  },
  "ERP": {
    "DESCRIPTION": {
      "INTRO": "<p>Кожне підприємство ставить перед собою певні цілі. Ці цілі і визначають успішність підприємства в сучасних реаліях. Підвищення якості продукції, оптимізація та зниження витрат, збільшення своєї частки на ринку, забезпечення необхідного рівня рентабельності - на шляху до цього компанії стикатися з різними проблемами:</p> <ul> <li>Складність узгодження дії різних структурних підрозділів</li> <li>Відсутність єдиного інформаційного простору для роботи кожного співробітника</li> <li>Неповний аналіз ефективності систем</li> <li>Виробничі проблеми</li> <li>Проблеми маркетингу, реклами і збуту</li> <li>Брак знань і досвіду у персоналу</li> <li>Галузеві специфіки діяльності різних підприємств</li> </ul> <p>Рішення даних проблем для сучасних підприємств ми бачимо в:</p> <ul> <li>Aвтоматізаціі основних процесів, що протікають на підприємстві</li> <li>Використання багатомодульних ERP систем, побудованих на базі Open Source (відкрите програмне забезпечення) технологій</li> <li>Застосування мікросервісів в таких системах</li> </ul>",
      "STRUCTURE": {
        "TITLE": "Структура ERP",
        "DESCRIPTION": "<p> <b> Платформа. </b> Програмне середовище, в якому буде виконуватися робота. Задаються правила поведінки, базовий функціонал і взаємодії модулів, компонентів цієї системи. </p> <p> <b> Дані. </b> У цю категорію входять сховище даних на сервері, програмне забезпечення для роботи з базами даних (SQL або альтернатива), інструменти для інтерпретації та обробки даних і відправки їх в програмні модулі. </p> <p> <b> Модулі. </b> Компоненти, які підключаються до платформи за необхідністю. Вони працюють з базою даних і застосовують базовий функціонал. В цілому модулі повинні працювати незалежно один від одного, і повинні «бесшовно» підключатися і відключатися, якщо зникла потреба. Ця парадигма відмінно вписується в концепцію мікросервісів. І є - важливою відмітною рисою JM cluster ERP-системи. </p>"
      },
      "MICROSERVICE": {
        "TITLE": "Мікросервісна архітектура",
        "DESCRIPTION": "<p> Описана вище структура характерна для ERP систем з логічної точки зору. Але на практиці важко реалізувати багатомодульність. І часто ERP системи виділяють всі модулі дійсно в окремі продукти. Що суперечить концепції. </p><p> Тому ми пропонуємо будувати ці модулі на базі мікросервісної архітектури. Що ж таке мікросервіси? </p><p> Це сучасне уявлення сервіс-орієнтованої архітектури (SOA), що використовується для створення розподілених програмних систем. Підмодулі в архітектурі мікросервісів взаємодіють один з одним для виконання певної мети. <b> Мікросервіси </b> - це архітектурний стиль, в якому великі складні програмні додатки складаються з одного або декількох менших мікросервісів. Кожен з цих мікросервісів зосереджений на виконанні одного завдання, яке представляє собою маленьку функціональність бізнесу. </p><p> Архітектурний підхід до проектування мікросервісів відмінно вписується в ідею модульності ERP систем і може привнести наступні переваги в ній. </p><p> <b> Гнучкість і ефективність роботи: </b> розробники можуть створювати, розгортати і тестувати мікросервіс незалежно від інших компонентів, використовуючи набагато коротші ітераційні цикли. Мікросервіс - всього лише один з безлічі компонентів, тому для його розробки можна використовувати найбільш придатну для необхідної функціональності мову програмування або середу, а також оптимальний механізм стійкості. </p><p> <b> Масштабованість: </b> команда розробників мікросервіса може масштабувати компоненти під час виконання незалежно від інших мікросервісів, тим самим забезпечуючи ефективне використання ресурсів і оперативне реагування на зміни навантаження. </p><p> <b> Стійкість: </b> різні технології, дозволяють швидко відключати мікросервіси в разі збоїв, без шкоди для інших незв'язаних функцій. У той же час в реалізаціях мікросервісів не застосовується модель збереження поточного стану, що дозволяє миттєво перерозподілити навантаження і практично негайно ініціювати нові середовища виконання. </p><p> В ERP системі дуже чітко розділені кордони модулів. І відключення будь-якого з них (крім деяких базових можливостей) ніяк не вплине на роботу решти. Якщо компанія націлена на максимальну відповідність постійно мінливих умовах ринку і потреб клієнтів, їй просто необхідно оперативний обмін даними між підрозділами і оперативність прийняття управлінських рішень. </p>"
      }
    }
  },
  "PROJECTS": {
    "TITLE": "Проєкти"
  },
  "SCIENCE": {
    "TITLE": "Наукова діяльність",
    "DESCRIPTION": "<h5>Основні напрямки наукової діяльності:</h5> <ul> <li>Моделювання швидко мінливих фізичних процесів</li> <li>Технології автоматизованого управління технологічними процесами</li> <li>Технологічне забезпечення High Speed Machining</li> <li>Інтелектуальні системи інженерного розрахунку</li> <li>Розробка та впровадження ERP систем і компонентів на Open Source технологіях і багато іншого</li> </ul> <h5>Публікації:</h5>"
  },
  "PARTICIPANTS": {
    "TITLE": "Учасники кластера"
  }
}